/**
 * [剑指 Offer 15] 二进制中1的个数
 *
 * 编写一个函数, 输入是一个无符号整数 (以二进制串的形式)
 * 返回其二进制表达式中数字位数为 '1' 的个数（也被称为汉明重量).
 * 
 * 
 * 示例1:
 *
 *
 * 输入: n = 11 (控制台输入 00000000000000000000000000001011)
 * 输出: 3
 * 解释: 输入的二进制串 00000000000000000000000000001011 中, 共有三位为 '1'.
 * 
 * 
 * 示例2:
 * 输入: n = 128 (控制台输入 00000000000000000000000010000000)
 * 输出: 1
 * 解释: 输入的二进制串 00000000000000000000000010000000 中, 共有一位为 '1'.
 * 
 *
 */
// problem: https://leetcode.cn/problems/lMSNwu/
use crate::{ListNode, to_list};
pub struct Solution;

impl Solution {
    fn hamming_weight(n: u32) -> usize {
        let mut n = n;
        let mut len = 0;
        while n != 0 { 
            n = n & (n - 1);
            len += 1; 
        }
        len
    }
}